# CannotEndWithZeroRiser Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotEndWithZeroRiser Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Can't end Stairs with Riser because Riser Thickness is too small.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotEndWithZeroRiser { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotEndWithZeroRiser As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotEndWithZeroRiser {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace